#### Olivia Davis' Midterm
I am making 3 dimension tables from the sakila database: films, customers, and staff. There is also a date dimension. These are all linked via a star schema with a fact rentals table in the center. I used csv files, json files, and connected directly to MySQL. I then made a query to demonstrate that the database was successful.

Step 1: I am putting the necessary import statements.

In [1]:

# using the appropriate import statements:

import os
import numpy
import pandas as pd
from sqlalchemy import create_engine

import json
import datetime
import pandas as pd
 
import pymongo

Step 2: I am setting up the server and necessary variables.

In [2]:
# setting up MySQL server: 

host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

# lab 4
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_host = "ds2002-mysql.mysql.database.azure.com"

atlas_cluster_name = "sandbox.zibbf" 
atlas_user_name = "m001-student"
atlas_password = "m001-mongodb-basics"

conn_str = {"local" : f"mongodb://localhost:27017/"
    
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")

Local Connection String: mongodb://localhost:27017/

Step 3: I am writing the necessary function defintions.

In [3]:
# necessary function definitions: (from both labs)

def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()
    

    # mongo DB functions from lab 4
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe

Step 4: I exported a films query as a json file in MySQL. Now, I am populating mongo DB with this film file.

In [4]:
# populate mongo DB with film json file:

client = pymongo.MongoClient(conn_str["local"]) # i changed this to local
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(),'data')

json_files = {"films":'dim_film_final3.json'
              
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

Step 5: I exported a staff query as a csv file in MySQL. Now, I am importing this csv file.

In [5]:
# importing csv file for staff
data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, 'dim_staff_final2.csv')

df_staff = pd.read_csv(data_file, header=0)
df_staff.head()

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update,address_id.1,address,address2,district,city_id,postal_code,phone,location,last_update.1
0,1,Mike,Hillyer,3,...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16,3,23 Workhaven Lane,NaN,Alberta,300,NaN,14033335568,...,2014-09-25 22:30:27
1,2,Jon,Stephens,4,NaN,Jon.Stephens@sakilastaff.com,2,1,Jon,NaN,2006-02-15 03:57:16,4,1411 Lillydale Drive,NaN,QLD,576,NaN,6172235589,...,2014-09-25 22:30:09

Step 6: Now, I am performing transformations on my staff table. I am dropping and renaming columns.

In [6]:
# transforming staff table
drop_cols = ['address_id','picture','active','last_update','address_id.1','address2','location','last_update.1']
df_staff.drop(drop_cols, axis=1, inplace=True) # in place -> does not take up more memory
df_staff.rename(columns={"staff_id":"staff_key","city_id":"city"}, inplace=True)

df_staff.head(2)

,staff_key,first_name,last_name,email,store_id,username,password,address,district,city,postal_code,phone
0,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,23 Workhaven Lane,Alberta,300,NaN,14033335568
1,2,Jon,Stephens,Jon.Stephens@sakilastaff.com,2,Jon,NaN,1411 Lillydale Drive,QLD,576,NaN,6172235589

Step 7: I exported a customers query as a csv file in MySQL. Now, I am importing this csv file.

In [7]:
# importing csv file for customers
data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, 'dim_customers_final6.csv')

df_customers = pd.read_csv(data_file, header=0)
df_customers.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update,address_id.1,address,address2,district,city_id,postal_code,phone,location,last_update.1
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20,5,1913 Hanoi Way,NaN,Nagasaki,463,35200,28303384290,...,2014-09-25 22:31:53
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20,6,1121 Loja Avenue,NaN,California,449,17886,838635286649,...,2014-09-25 22:34:01

Step 8: Now, I am performing transformations on my customers table. I am dropping and renaming columns.

In [8]:
# transforming customers table
drop_cols = ['address_id','active','create_date','last_update','address_id.1','address2','location','last_update.1']
df_customers.drop(drop_cols, axis=1, inplace=True) # in place -> does not take up more memory
df_customers.rename(columns={"customer_id":"customer_key","city_id":"city"}, inplace=True)

df_customers.head(2)

,customer_key,store_id,first_name,last_name,email,address,district,city,postal_code,phone
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1913 Hanoi Way,Nagasaki,463,35200,28303384290
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1121 Loja Avenue,California,449,17886,838635286649

Step 9: Now, I am getting the film table from mongoDB.

In [9]:

# querying from mongodb for film table
query = {}
collection = "films"

df_films = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_films.head(2)

,film_id,category_id,last_update,name,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,6,2006-02-15 05:03:42,Documentary,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,11,2006-02-15 05:03:42,Horror,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

Step 10: Now, I am performing transformations on my films table. I am dropping and renaming columns.

In [10]:
# transforming film dimension table

drop_cols = ['category_id','last_update','language_id','original_language_id','rental_duration']
df_films.drop(drop_cols, axis=1, inplace=True)
df_films.rename(columns={"film_id":"film_key","name":"category"}, inplace=True)

df_films.head(2)

,film_key,category,title,description,release_year,rental_rate,length,replacement_cost,rating,special_features
0,1,Documentary,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,Horror,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,4.99,48,12.99,G,"Trailers,Deleted Scenes"

Step 11: Now, I am creating the sakila dw database and inserting the three dimension tables into the new database.

In [11]:
# creating sakila dw database
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [12]:
# inserting dimension tables to sakila dw

db_operation = "insert"

tables = [('dim_films', df_films, 'film_key'),
          ('dim_customers', df_customers, 'customer_key'),
          ('dim_staff', df_staff, 'staff_key')]

In [13]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

Step 12: Now, I am getting my rental fact table from MySQL and performing joins with other tables from MySQL. The payment table has information about payment that I want in my fact table. The inventory table has the film key and rental key, and I want this in my fact table.

In [14]:
# crafting rental fact table (getting data from mysql):
sql_rentals = "SELECT * FROM sakila.rental;"
fact_rentals = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rentals)
fact_rentals.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [15]:
# performing joins to transform fact table
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_payment)

sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory)


fact_rentals2 = pd.merge(fact_rentals, df_payment, on='rental_id', how='inner')
fact_rentals3 = pd.merge(fact_rentals2, df_inventory, on='inventory_id', how='inner')
fact_rentals3.head(2)

,rental_id,rental_date,inventory_id,customer_id_x,return_date,staff_id_x,last_update_x,payment_id,customer_id_y,staff_id_y,amount,payment_date,last_update_y,film_id,store_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,3504,130,1,2.99,2005-05-24 22:53:30,2006-02-15 22:13:16,80,1,2006-02-15 05:09:17
1,1577,2005-06-16 04:03:28,367,327,2005-06-24 22:40:28,2,2006-02-15 21:30:53,8828,327,2,3.99,2005-06-16 04:03:28,2006-02-15 22:16:10,80,1,2006-02-15 05:09:17

Step 13: Now, I am performing transformations on my fact table. I am dropping and renaming columns. i also ordered them (although I will do this again after I put date keys in).

In [16]:
# transforming my fact table
drop_cols = ['inventory_id','payment_id','customer_id_y','staff_id_y','last_update_x','last_update_y','payment_date','last_update']
fact_rentals3.rename(columns={"rental_id":"fact_rental_key","customer_id_x":"customer_key","staff_id_x":"staff_key","film_id":"film_key"}, inplace=True)
fact_rentals3.drop(drop_cols, axis=1, inplace=True) 
fact_rentals3.head(2)

,fact_rental_key,rental_date,customer_key,return_date,staff_key,amount,film_key,store_id
0,1,2005-05-24 22:53:30,130,2005-05-26 22:04:30,1,2.99,80,1
1,1577,2005-06-16 04:03:28,327,2005-06-24 22:40:28,2,3.99,80,1

In [17]:
# ordering fact table
ordered_columns = ['fact_rental_key','film_key','customer_key','staff_key','rental_date','return_date','amount','store_id']
fact_rentals4 = fact_rentals3[ordered_columns]
fact_rentals4.head()

,fact_rental_key,film_key,customer_key,staff_key,rental_date,return_date,amount,store_id
0,1,80,130,1,2005-05-24 22:53:30,2005-05-26 22:04:30,2.99,1
1,1577,80,327,2,2005-06-16 04:03:28,2005-06-24 22:40:28,3.99,1
2,3584,80,207,1,2005-07-06 04:16:43,2005-07-13 07:08:43,2.99,1
3,10507,80,45,2,2005-08-01 11:22:20,2005-08-04 13:18:20,2.99,1
4,13641,80,281,1,2005-08-20 07:34:42,2005-08-26 05:18:42,2.99,1

Step 14: In MySQL, I created a populated a date dimension table. Now, I will perform a lookup with this table to change rental date and return date columns to keys linking to the date dimension. I will drop rental and return date and just keep the new keys.

In [18]:
# performing lookup for date dimension
# First, fetch the Surrogate Primary Key (date_key) and the Business Key (full_date) from the Date Dimension table.
sql_dim_date = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [20]:
fact_rentals4['rental_date']=fact_rentals4['rental_date'].dt.date
fact_rentals4.rental_date = fact_rentals4.rental_date.astype('datetime64')

fact_rentals4['return_date']=fact_rentals4['return_date'].dt.date
fact_rentals4.return_date = fact_rentals4.return_date.astype('datetime64')

fact_rentals4.dtypes

fact_rental_key             int64
film_key                    int64
customer_key                int64
staff_key                   int64
rental_date        datetime64[ns]
return_date        datetime64[ns]
amount                    float64
store_id                    int64
dtype: object

In [21]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "rental_date" Column.
df_dim_rental_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
fact_rentals4 = pd.merge(fact_rentals4, df_dim_rental_date, on='rental_date', how='left')
fact_rentals4.drop(['rental_date'], axis=1, inplace=True)
fact_rentals4.head(2)

,fact_rental_key,film_key,customer_key,staff_key,return_date,amount,store_id,rental_date_key
0,1,80,130,1,2005-05-26,2.99,1,20050524
1,1577,80,327,2,2005-06-24,3.99,1,20050616

In [22]:
#Lookup the Surrogate Primary Key (date_key) that Corresponds to the "return_date" Column.
df_dim_return_date = df_dim_date.rename(columns={"date_key" : "return_date_key", "full_date" : "return_date"})
fact_rentals4 = pd.merge(fact_rentals4, df_dim_return_date, on='return_date', how='left')
fact_rentals4.drop(['return_date'], axis=1, inplace=True)
fact_rentals4.head(2)

,fact_rental_key,film_key,customer_key,staff_key,amount,store_id,rental_date_key,return_date_key
0,1,80,130,1,2.99,1,20050524,20050526.0
1,1577,80,327,2,3.99,1,20050616,20050624.0

Step 15: Now, I am reordering the columns in my fact table to prepare it for the database.

In [23]:
# reordering columns in fact table
ordered_columns = ['fact_rental_key','film_key','customer_key','staff_key','rental_date_key','return_date_key','amount','store_id']
fact_rentals4 = fact_rentals4[ordered_columns]
fact_rentals4.head()

,fact_rental_key,film_key,customer_key,staff_key,rental_date_key,return_date_key,amount,store_id
0,1,80,130,1,20050524,20050526.0,2.99,1
1,1577,80,327,2,20050616,20050624.0,3.99,1
2,3584,80,207,1,20050706,20050713.0,2.99,1
3,10507,80,45,2,20050801,20050804.0,2.99,1
4,13641,80,281,1,20050820,20050826.0,2.99,1

Step 16: Now I am inserting the fact rental table into the database.

In [24]:
# putting fact rental table into database
table_name = "fact_rentals"
primary_key = "fact_rental_key"
#set dataframe
db_operation= "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, fact_rentals4, table_name, primary_key, db_operation)

Step 17: Now I am testing my database by making a query. The query will display each customer, the total amount they spent on rentals, and the average length of the films they rented.

In [25]:
# crafting query: the total amount each customer spent and the average minutes they spent watching films (based on film length)
sql_test = """
SELECT customers.`last_name` AS `customer_name`,
SUM(rentals.`amount`) AS `total_amount`,
AVG(films.`length`) AS `average_rented_film_length`
FROM `{0}`.`fact_rentals` AS rentals
INNER JOIN `{0}`.`dim_customers` AS customers
ON rentals.`customer_key` = customers.`customer_key`
INNER JOIN `{0}`.`dim_films` AS films
ON rentals.`film_key` = films.`film_key`
GROUP BY customers.`last_name`
ORDER BY `total_amount` DESC
LIMIT 5;
""".format(dst_dbname)

df_test = get_dataframe(user_id,pwd,host_name,src_dbname,sql_test)

In [26]:

df_test

  customer_name  total_amount  average_rented_film_length
0          SEAL        221.55                    119.7333
1          HUNT        216.54                    116.5217
2          SHAW        195.58                    114.4762
3        SNYDER        194.61                    117.9231
4       KENNEDY        194.61                    110.4359

In [ ]:
# do I need to display my database here, or do I export it?